OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf4439.h
//----------------------------- CONFIG4L Options -------------------------------

#define _STVR_OFF_4L            0xFE    // Stack Full/Underflow will not cause RESET.
#define _STVR_ON_4L             0xFF    // Stack Full/Underflow will cause RESET.
#define _LVP_OFF_4L             0xFB    // Low Voltage ICSP disabled.
#define _LVP_ON_4L              0xFF    // Low Voltage ICSP enabled.
#define _DEBUG_ON_4L            0x7F    // Background Debugger enabled. RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background Debugger disabled. RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (000200-001FFFh) code protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (000200-001FFFh) not code protected.
#define _CP1_ON_5L              0xFD    // Block 1 (002000-003FFFh) code protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (002000-003FFFh) not code protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot block (000000-0001FFh) code protected.
#define _CPB_OFF_5H             0xFF    // Boot block (000000-0001FFh) not code protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM code protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM not code protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000200h-001FFFh) write protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000200h-001FFFh) not write protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (002000-003FFFh) write protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (002000-003FFFh) not write protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) write protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) not write protected.
#define _WRTB_ON_6H             0xBF    // Boot block (000000-0001FFh) write protected.
#define _WRTB_OFF_6H            0xFF    // Boot block (000000-0001FFh) not write protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM write protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM not write protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (000200h-001FFFh) protected from Table Reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (000200h-001FFFh) not protected from Table Reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (002000-003FFFh) protected from Table Reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (002000-003FFFh) not protected from Table Reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot block (000000-0001FFh) protected from Table Reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot block (000000-0001FFh) not protected from Table Reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18LF4439_H__
